// Day 3. Функции. Глобальные и локальные переменные.
/*--------------------------------------------------------
Задание:
1) Изучите разницу между глобальными и локальными переменными.
--------------------------------------------------------*/

#include <iostream>

int g_val = 99;

int example_foo(){
	// Глобальные переменные (g_val), определенные выше,
	// видны в теле функции.
	int L_val = g_val + 1;
	return L_val;
}

int main() {
	// Локальные переменные (L_val) не видны вне функции:
	// Их имена могут быть переиспользованы в разных функциях.
	float L_val = 14.4;
	std::cout << example_foo() << '\n';
	std::cout << L_val << '\n';
}
