// Day 3. Функции. Передача аргумента по указателю.
/*--------------------------------------------------------
Задание:
1) Изучите механизм передачи аргумента функции
	по указателю.
--------------------------------------------------------*/

#include <iostream>

// При передаче аргумента по значению, сам аргумент
// является локальной переменной функции и содержит
// копию(!) исходного объекта.
int foo(int a){
	a++;
	return a;
}

// При передаче указателя - копируется значение указателя.
// Указатель является локальной переменной функции.
// При этом функция получает возможность менять
// исходную переменную, через копию указателя.
int bar(int *a){
	*a = *a + 100;
	return *a;
}

int main() {
	int v = 0;
	
	std::cout << "value of v = " << v << '\n';
	std::cout << "value of foo(v) = " << foo(v) << '\n';
	std::cout << "value of v after foo(v) = " << v << '\n';
	std::cout << "value of bar(&v) = " << bar(&v) << '\n';
	std::cout << "value of v after bar(&v) = " << v << '\n';
}
